{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-ACCOUNT_NUMBER",
    "2": "B-AMOUNT",
    "3": "B-BANK",
    "4": "B-CARD_TYPE",
    "5": "B-DATE",
    "6": "B-MOBILE_NUMBER",
    "7": "B-ORG_MERCHANT_NAME",
    "8": "B-OTP",
    "9": "B-PAYMENT_APP",
    "10": "B-PERSON_NAME",
    "11": "B-PLACE",
    "12": "B-PLAN_DETAIL",
    "13": "B-RECHARGE_PLAN",
    "14": "B-REFERENCE_NUMBER",
    "15": "B-SECURITY_CODE",
    "16": "B-SERVICE_PROVIDER",
    "17": "B-TELCO_OPERATOR",
    "18": "B-TIME",
    "19": "B-TRANSACTION_TYPE",
    "20": "B-UPI_ID",
    "21": "I-ACCOUNT_NUMBER",
    "22": "I-AMOUNT",
    "23": "I-BANK",
    "24": "I-DATE",
    "25": "I-ORG_MERCHANT_NAME",
    "26": "I-OTP",
    "27": "I-PAYMENT_APP",
    "28": "I-PERSON_NAME",
    "29": "I-PLACE",
    "30": "I-PLAN_DETAIL",
    "31": "I-RECHARGE_PLAN",
    "32": "I-REFERENCE_NUMBER",
    "33": "I-SECURITY_CODE",
    "34": "I-SERVICE_PROVIDER",
    "35": "I-TIME",
    "36": "I-TRANSACTION_TYPE",
    "37": "I-UPI_ID"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ACCOUNT_NUMBER": 1,
    "B-AMOUNT": 2,
    "B-BANK": 3,
    "B-CARD_TYPE": 4,
    "B-DATE": 5,
    "B-MOBILE_NUMBER": 6,
    "B-ORG_MERCHANT_NAME": 7,
    "B-OTP": 8,
    "B-PAYMENT_APP": 9,
    "B-PERSON_NAME": 10,
    "B-PLACE": 11,
    "B-PLAN_DETAIL": 12,
    "B-RECHARGE_PLAN": 13,
    "B-REFERENCE_NUMBER": 14,
    "B-SECURITY_CODE": 15,
    "B-SERVICE_PROVIDER": 16,
    "B-TELCO_OPERATOR": 17,
    "B-TIME": 18,
    "B-TRANSACTION_TYPE": 19,
    "B-UPI_ID": 20,
    "I-ACCOUNT_NUMBER": 21,
    "I-AMOUNT": 22,
    "I-BANK": 23,
    "I-DATE": 24,
    "I-ORG_MERCHANT_NAME": 25,
    "I-OTP": 26,
    "I-PAYMENT_APP": 27,
    "I-PERSON_NAME": 28,
    "I-PLACE": 29,
    "I-PLAN_DETAIL": 30,
    "I-RECHARGE_PLAN": 31,
    "I-REFERENCE_NUMBER": 32,
    "I-SECURITY_CODE": 33,
    "I-SERVICE_PROVIDER": 34,
    "I-TIME": 35,
    "I-TRANSACTION_TYPE": 36,
    "I-UPI_ID": 37,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.0",
  "vocab_size": 30522
}
